```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # turbot_policy_setting.aws_apigateway_api_approved[0] will be created
  + resource "turbot_policy_setting" "aws_apigateway_api_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-apigateway#/policy/types/apiApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_apigateway_api_approved_usage[0] will be created
  + resource "turbot_policy_setting" "aws_apigateway_api_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {%- if $.api.endpointConfiguration.types == "PRIVATE" -%}
            Approved
            {%- else -%}
            Not approved
            {%- endif -%}
        EOT
      + template_input               = <<-EOT
            {
              api{
                endpointConfiguration
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-apigateway#/policy/types/apiApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_alb_approved[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_alb_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/applicationLoadBalancerApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_alb_approved_usage[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_alb_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {%- if $.resource.scheme == "internal" -%}
            Approved
            {%- else -%}
            Not approved
            {%- endif -%}
        EOT
      + template_input               = <<-EOT
            {
              resource {
                scheme: get(path: "Scheme")
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/applicationLoadBalancerApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_ami_trusted_access[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_ami_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/amiTrustedAccess"
      + value                        = "Check: Trusted Access > Accounts"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_elb_approved[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_elb_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/classicLoadBalancerApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_elb_approved_usage[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_elb_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {%- if $.resource.scheme == "internal" -%}
            Approved
            {%- else -%}
            Not approved
            {%- endif -%}
        EOT
      + template_input               = <<-EOT
            {
              resource {
                scheme: get(path: "Scheme")
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/classicLoadBalancerApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_instance_approved_public_ip[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_instance_approved_public_ip" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/instanceApprovedPublicIp"
      + value                        = "Approved if not assigned"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_instance_metadata_service[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_instance_metadata_service" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/instanceMetadataService"
      + value                        = "Check: Enabled for V2 only"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_instance_metadata_service_token_hop_limit[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_instance_metadata_service_token_hop_limit" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/instanceMetadataServiceTokenHopLimit"
      + value                        = "1"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_nlb_approved[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_nlb_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/networkLoadBalancerApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_ec2_nlb_approved_usage[0] will be created
  + resource "turbot_policy_setting" "aws_ec2_nlb_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {%- if $.resource.scheme == "internal" -%}
            Approved
            {%- else -%}
            Not approved
            {%- endif -%}
        EOT
      + template_input               = <<-EOT
            {
              resource {
                scheme: get(path: "Scheme")
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/networkLoadBalancerApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_lambda_function_approved[0] will be created
  + resource "turbot_policy_setting" "aws_lambda_function_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-lambda#/policy/types/functionApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_lambda_function_approved_usage[0] will be created
  + resource "turbot_policy_setting" "aws_lambda_function_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {% if 'VpcConfig' in $.resource.object %}
                Approved
            {% else %}
                Not approved
            {% endif %}
        EOT
      + template_input               = <<-EOT
            {
                resource{
                    object
                }
            }
        EOT
      + type                         = "tmod:@turbot/aws-lambda#/policy/types/functionApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_s3_account_public_access_block[0] will be created
  + resource "turbot_policy_setting" "aws_s3_account_public_access_block" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-s3#/policy/types/s3AccountPublicAccessBlock"
      + value                        = "Check: Per `Public Access Block  > Settings`"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_s3_account_public_access_block_settings[0] will be created
  + resource "turbot_policy_setting" "aws_s3_account_public_access_block_settings" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-s3#/policy/types/s3AccountPublicAccessBlockSettings"
      + value                        = <<-EOT
            - Block Public ACLs
            - Block Public Bucket Policies
            - Ignore Public ACLs
            - Restrict Public Bucket Policies
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_s3_public_access_block[0] will be created
  + resource "turbot_policy_setting" "aws_s3_public_access_block" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-s3#/policy/types/s3BucketPublicAccessBlock"
      + value                        = "Check: Per `Public Access Block  > Settings`"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_s3_public_access_block_settings[0] will be created
  + resource "turbot_policy_setting" "aws_s3_public_access_block_settings" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-s3#/policy/types/s3BucketPublicAccessBlockSettings"
      + value                        = <<-EOT
            - Block Public ACLs
            - Block Public Bucket Policies
            - Ignore Public ACLs
            - Restrict Public Bucket Policies
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_sns_topic_trusted_access[0] will be created
  + resource "turbot_policy_setting" "aws_sns_topic_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-sns#/policy/types/topicPolicyTrustedAccess"
      + value                        = "Check: Trusted Access"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_trusted_accounts_template[0] will be created
  + resource "turbot_policy_setting" "aws_trusted_accounts_template" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            - "{{ $.account.Id }}"
            - "287590803701"
            - "255798382450"
            
        EOT
      + template_input               = <<-EOT
            {
            account{
             Id
              }
            }
        EOT
      + type                         = "tmod:@turbot/aws#/policy/types/trustedAccounts"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_vpc_elastic_ip_approved[0] will be created
  + resource "turbot_policy_setting" "aws_vpc_elastic_ip_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-internet#/policy/types/elasticIpApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_vpc_elastic_ip_approved_usage[0] will be created
  + resource "turbot_policy_setting" "aws_vpc_elastic_ip_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-internet#/policy/types/elasticIpApprovedUsage"
      + value                        = "Not approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_vpc_igw_approved[0] will be created
  + resource "turbot_policy_setting" "aws_vpc_igw_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-internet#/policy/types/internetGatewayApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_vpc_igw_approved_usage[0] will be created
  + resource "turbot_policy_setting" "aws_vpc_igw_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-internet#/policy/types/internetGatewayApprovedUsage"
      + value                        = "Not approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_vpc_security_group_ingress_rule_approved[0] will be created
  + resource "turbot_policy_setting" "aws_vpc_security_group_ingress_rule_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-security#/policy/types/securityGroupIngressRulesApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_vpc_security_group_ingress_rule_approved_cidr_ranges[0] will be created
  + resource "turbot_policy_setting" "aws_vpc_security_group_ingress_rule_approved_cidr_ranges" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-security#/policy/types/securityGroupIngressRulesApprovedCidrRanges"
      + value                        = <<-EOT
            # RFC 1918
            - 10.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_vpc_subnet_approved[0] will be created
  + resource "turbot_policy_setting" "aws_vpc_subnet_approved" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-core#/policy/types/subnetApproved"
      + value                        = "Check: Approved"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.aws_vpc_subnet_approved_usage[0] will be created
  + resource "turbot_policy_setting" "aws_vpc_subnet_approved_usage" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + template                     = <<-EOT
            {%- if $.resource.publicIp -%}
                Not approved
            {%- else -%}
                Approved
            {%- endif -%}
        EOT
      + template_input               = <<-EOT
            {
                resource {
                    publicIp: get(path: "MapPublicIpOnLaunch")
                }
            }
        EOT
      + type                         = "tmod:@turbot/aws-vpc-core#/policy/types/subnetApprovedUsage"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.ec2_snapshot_trusted_access[0] will be created
  + resource "turbot_policy_setting" "ec2_snapshot_trusted_access" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-ec2#/policy/types/snapshotTrustedAccess"
      + value                        = "Check: Trusted Access > Accounts"
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_policy_setting.security_Group_IngressRules_ApprovedRules[0] will be created
  + resource "turbot_policy_setting" "security_Group_IngressRules_ApprovedRules" {
      + id                           = (known after apply)
      + precedence                   = "REQUIRED"
      + resource                     = (known after apply)
      + resource_akas                = (known after apply)
      + type                         = "tmod:@turbot/aws-vpc-security#/policy/types/securityGroupIngressRulesApprovedRules"
      + value                        = <<-EOT
              REJECT $.turbot.ports.+:22,3389 $.turbot.cidr:0.0.0.0/0,::/0
              APPROVE *
        EOT
      + value_key_fingerprint        = (known after apply)
      + value_source                 = (known after apply)
      + value_source_key_fingerprint = (known after apply)
      + value_source_used            = (known after apply)
    }

  # turbot_smart_folder.aws_public_access will be created
  + resource "turbot_smart_folder" "aws_public_access" {
      + description = "Defines sets of policies for the AWS check S3 baseline"
      + id          = (known after apply)
      + parent      = "tmod:@turbot/turbot#/"
      + parent_akas = (known after apply)
      + title       = "AWS Check Public Access Policies"
    }

Plan: 31 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + enable_aws_apigateway_api_approved                              = true
  + enable_aws_apigateway_api_approved_usage                        = true
  + enable_aws_ec2_alb_approved                                     = true
  + enable_aws_ec2_alb_approved_usage                               = true
  + enable_aws_ec2_ami_trusted_access                               = true
  + enable_aws_ec2_elb_approved                                     = true
  + enable_aws_ec2_elb_approved_usage                               = true
  + enable_aws_ec2_instance_approved_public_ip                      = true
  + enable_aws_ec2_instance_metadata_service                        = true
  + enable_aws_ec2_instance_metadata_service_token_hop_limit        = true
  + enable_aws_ec2_nlb_approved                                     = true
  + enable_aws_ec2_nlb_approved_usage                               = true
  + enable_aws_lambda_function_approved                             = true
  + enable_aws_lambda_function_approved_usage                       = true
  + enable_aws_rds_db_cluster_snapshot_manual_trusted_access        = false
  + enable_aws_rds_db_instance_public                               = false
  + enable_aws_rds_db_snapshot_manual_trusted_access                = false
  + enable_aws_redshift_cluster_public                              = false
  + enable_aws_redshift_cluster_snapshot_manual_trusted_access      = false
  + enable_aws_route53_hostedzone_approved                          = false
  + enable_aws_route53_hostedzone_approved_usage                    = false
  + enable_aws_s3_account_public_access_block                       = true
  + enable_aws_s3_account_public_access_block_settings              = true
  + enable_aws_s3_public_access_block                               = true
  + enable_aws_s3_public_access_block_settings                      = true
  + enable_aws_sns_topic_trusted_access                             = true
  + enable_aws_sqs_queue_trusted_access                             = false
  + enable_aws_trusted_accounts_template                            = true
  + enable_aws_vpc_elastic_ip_approved                              = true
  + enable_aws_vpc_elastic_ip_approved_usage                        = true
  + enable_aws_vpc_igw_approved                                     = true
  + enable_aws_vpc_igw_approved_usage                               = true
  + enable_aws_vpc_security_group_ingress_rule_approved             = true
  + enable_aws_vpc_security_group_ingress_rule_approved_cidr_ranges = true
  + enable_aws_vpc_subnet_approved                                  = true
  + enable_aws_vpc_subnet_approved_usage                            = true
  + enable_ec2_snapshot_approved_usage                              = false
  + enable_ec2_snapshot_trusted_access                              = true
  + enable_security_Group_IngressRules_ApprovedRules                = true
  + trusted_accounts                                                = [
      + "{{ $.account.Id }}",
      + "287590803701",
      + "255798382450",
    ]

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

turbot_smart_folder.aws_public_access: Creating...
turbot_smart_folder.aws_public_access: Creation complete after 1s [id=215881184340183]
turbot_policy_setting.aws_lambda_function_approved[0]: Creating...
turbot_policy_setting.aws_ec2_alb_approved_usage[0]: Creating...
turbot_policy_setting.aws_s3_public_access_block_settings[0]: Creating...
turbot_policy_setting.aws_vpc_elastic_ip_approved_usage[0]: Creating...
turbot_policy_setting.aws_vpc_elastic_ip_approved[0]: Creating...
turbot_policy_setting.security_Group_IngressRules_ApprovedRules[0]: Creating...
turbot_policy_setting.aws_vpc_subnet_approved[0]: Creating...
turbot_policy_setting.aws_vpc_subnet_approved_usage[0]: Creating...
turbot_policy_setting.aws_ec2_elb_approved_usage[0]: Creating...
turbot_policy_setting.aws_ec2_ami_trusted_access[0]: Creating...
turbot_policy_setting.aws_ec2_alb_approved_usage[0]: Creation complete after 3s [id=215881187269918]
turbot_policy_setting.ec2_snapshot_trusted_access[0]: Creating...
turbot_policy_setting.aws_ec2_elb_approved_usage[0]: Creation complete after 3s [id=215881187470634]
turbot_policy_setting.aws_ec2_instance_metadata_service[0]: Creating...
turbot_policy_setting.aws_lambda_function_approved[0]: Creation complete after 3s [id=215881187451173]
turbot_policy_setting.aws_vpc_elastic_ip_approved_usage[0]: Creation complete after 3s [id=215881187596593]
turbot_policy_setting.aws_vpc_igw_approved_usage[0]: Creating...
turbot_policy_setting.aws_ec2_alb_approved[0]: Creating...
turbot_policy_setting.aws_vpc_elastic_ip_approved[0]: Creation complete after 4s [id=215881187834172]
turbot_policy_setting.security_Group_IngressRules_ApprovedRules[0]: Creation complete after 4s [id=215881187841344]
turbot_policy_setting.aws_s3_public_access_block_settings[0]: Creation complete after 4s [id=215881188176207]
turbot_policy_setting.aws_ec2_instance_metadata_service_token_hop_limit[0]: Creating...
turbot_policy_setting.aws_apigateway_api_approved[0]: Creating...
turbot_policy_setting.aws_vpc_igw_approved[0]: Creating...
turbot_policy_setting.aws_vpc_subnet_approved_usage[0]: Creation complete after 4s [id=215881187820856]
turbot_policy_setting.aws_ec2_ami_trusted_access[0]: Creation complete after 4s [id=215881187903817]
turbot_policy_setting.aws_vpc_subnet_approved[0]: Creation complete after 4s [id=215881187838270]
turbot_policy_setting.aws_ec2_elb_approved[0]: Creating...
turbot_policy_setting.aws_s3_account_public_access_block_settings[0]: Creating...
turbot_policy_setting.aws_sns_topic_trusted_access[0]: Creating...
turbot_policy_setting.ec2_snapshot_trusted_access[0]: Creation complete after 2s [id=215881189540181]
turbot_policy_setting.aws_s3_account_public_access_block[0]: Creating...
turbot_policy_setting.aws_vpc_igw_approved_usage[0]: Creation complete after 2s [id=215881189553497]
turbot_policy_setting.aws_vpc_security_group_ingress_rule_approved_cidr_ranges[0]: Creating...
turbot_policy_setting.aws_ec2_alb_approved[0]: Creation complete after 2s [id=215881190048097]
turbot_policy_setting.aws_ec2_instance_metadata_service[0]: Creation complete after 2s [id=215881190045023]
turbot_policy_setting.aws_apigateway_api_approved_usage[0]: Creating...
turbot_policy_setting.aws_s3_public_access_block[0]: Creating...
turbot_policy_setting.aws_apigateway_api_approved[0]: Creation complete after 2s [id=215881190701423]
turbot_policy_setting.aws_sns_topic_trusted_access[0]: Creation complete after 2s [id=215881190579563]
turbot_policy_setting.aws_ec2_instance_metadata_service_token_hop_limit[0]: Creation complete after 2s [id=215881190834556]
turbot_policy_setting.aws_trusted_accounts_template[0]: Creating...
turbot_policy_setting.aws_ec2_nlb_approved[0]: Creating...
turbot_policy_setting.aws_vpc_security_group_ingress_rule_approved[0]: Creating...
turbot_policy_setting.aws_ec2_elb_approved[0]: Creation complete after 2s [id=215881190711667]
turbot_policy_setting.aws_vpc_igw_approved[0]: Creation complete after 2s [id=215881190823288]
turbot_policy_setting.aws_lambda_function_approved_usage[0]: Creating...
turbot_policy_setting.aws_ec2_instance_approved_public_ip[0]: Creating...
turbot_policy_setting.aws_s3_account_public_access_block[0]: Creation complete after 2s [id=215881191608710]
turbot_policy_setting.aws_s3_account_public_access_block_settings[0]: Creation complete after 3s [id=215881191489922]
turbot_policy_setting.aws_ec2_nlb_approved_usage[0]: Creating...
turbot_policy_setting.aws_trusted_accounts_template[0]: Creation complete after 2s [id=215881193019796]
turbot_policy_setting.aws_lambda_function_approved_usage[0]: Creation complete after 2s [id=215881193022870]
turbot_policy_setting.aws_s3_public_access_block[0]: Creation complete after 3s [id=215881192266125]
turbot_policy_setting.aws_ec2_nlb_approved[0]: Creation complete after 2s [id=215881193023895]
turbot_policy_setting.aws_apigateway_api_approved_usage[0]: Creation complete after 4s [id=215881193480608]
turbot_policy_setting.aws_vpc_security_group_ingress_rule_approved_cidr_ranges[0]: Creation complete after 4s [id=215881193712038]
turbot_policy_setting.aws_ec2_nlb_approved_usage[0]: Creation complete after 2s [id=215881193774513]
turbot_policy_setting.aws_ec2_instance_approved_public_ip[0]: Creation complete after 3s [id=215881193766315]
turbot_policy_setting.aws_vpc_security_group_ingress_rule_approved[0]: Creation complete after 3s [id=215881193771436]

Apply complete! Resources: 31 added, 0 changed, 0 destroyed.

Outputs:

enable_aws_apigateway_api_approved = true
enable_aws_apigateway_api_approved_usage = true
enable_aws_ec2_alb_approved = true
enable_aws_ec2_alb_approved_usage = true
enable_aws_ec2_ami_trusted_access = true
enable_aws_ec2_elb_approved = true
enable_aws_ec2_elb_approved_usage = true
enable_aws_ec2_instance_approved_public_ip = true
enable_aws_ec2_instance_metadata_service = true
enable_aws_ec2_instance_metadata_service_token_hop_limit = true
enable_aws_ec2_nlb_approved = true
enable_aws_ec2_nlb_approved_usage = true
enable_aws_lambda_function_approved = true
enable_aws_lambda_function_approved_usage = true
enable_aws_rds_db_cluster_snapshot_manual_trusted_access = false
enable_aws_rds_db_instance_public = false
enable_aws_rds_db_snapshot_manual_trusted_access = false
enable_aws_redshift_cluster_public = false
enable_aws_redshift_cluster_snapshot_manual_trusted_access = false
enable_aws_route53_hostedzone_approved = false
enable_aws_route53_hostedzone_approved_usage = false
enable_aws_s3_account_public_access_block = true
enable_aws_s3_account_public_access_block_settings = true
enable_aws_s3_public_access_block = true
enable_aws_s3_public_access_block_settings = true
enable_aws_sns_topic_trusted_access = true
enable_aws_sqs_queue_trusted_access = false
enable_aws_trusted_accounts_template = true
enable_aws_vpc_elastic_ip_approved = true
enable_aws_vpc_elastic_ip_approved_usage = true
enable_aws_vpc_igw_approved = true
enable_aws_vpc_igw_approved_usage = true
enable_aws_vpc_security_group_ingress_rule_approved = true
enable_aws_vpc_security_group_ingress_rule_approved_cidr_ranges = true
enable_aws_vpc_subnet_approved = true
enable_aws_vpc_subnet_approved_usage = true
enable_ec2_snapshot_approved_usage = false
enable_ec2_snapshot_trusted_access = true
enable_security_Group_IngressRules_ApprovedRules = true
trusted_accounts = tolist([
  "{{ $.account.Id }}",
  "287590803701",
  "255798382450",
])
```